Autodesk.Revit.DB.StdPostedWarning.GetElements
Get ElementIds related to warning.
Since:
2019

Autodesk.Revit.DB.StdPostedWarning.UpdateWarning(Autodesk.Revit.DB.Document,System.Boolean)
Updates warning state.
doc:
document
state:
state
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.StdPostedWarning.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.StdPostedWarning.FailureDefinitionId
Identity of failure reported for element.
Since:
2019

Autodesk.Revit.DB.StdPostedWarning.#ctor(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.FailureDefinitionId)
Construct structure containing failure identity and element id.
elementId:
The identity of element.
failureDefinitionId:
The identity of failure.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.StdPostedWarning.#ctor(System.Collections.Generic.ISet{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.FailureDefinitionId)
Construct structure containing failure identity and element id.
elemIds:
The identities of elements.
failureDefinitionId:
The identity of failure.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.StdPostedWarning
Support for Reviewable Warnings sent from AddOn.
Remarks:
Used to create and send Reviewable Warning from AddOn.
Since:
2019